Tekla.Structures.Drawing.PickerInputNPoints
The PickerInputNPoints class represents a pick of several points in a view.
Used for values asked by UI.Picker.PickPoints(StringList Prompts, out PointList PickedPoints, out ViewBase PickedView) and
UI.Picker.PickPoints(int NumberOfPicks, StringList Prompts, out PointList PickedPoints, out ViewBase PickedView).

Tekla.Structures.Drawing.PickerInputNPoints.PickedPoints
Gets or sets the list of picked points in the view coordinates.

Tekla.Structures.Drawing.PickerInputNPoints.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList)
Creates a new PickerInputNPoints instance representing N points selected in a view.
pickedView: The view in which the pick occurred.
pickedPoints: The list of picked points in the view coordinates.